### Importing libraries

In [16]:
import pandas as pd
import seaborn as sn

### Importing data

In [17]:
df_home = pd.read_csv('./data/home_page_table.csv')

In [22]:
df_payment_page = pd.read_csv('./data/payment_page_table.csv')

In [25]:
df_conformation = pd.read_csv('./data/payment_confirmation_table.csv')

In [28]:
df_search = pd.read_csv('./data/search_page_table.csv')

#### Quick inspection

In [18]:
df_home.head(3)

   user_id       page
0   313593  home_page
1   468315  home_page
2   264005  home_page

In [19]:
df_home.count()

user_id    90400
page       90400
dtype: int64

In [20]:
df_search.head(3)

   user_id         page
0    15866  search_page
1   347058  search_page
2   577020  search_page

In [21]:
df_search.count()

user_id    45200
page       45200
dtype: int64

In [23]:
df_payment_page.head(3)

   user_id          page
0   253019  payment_page
1   310478  payment_page
2   304081  payment_page

In [24]:
df_payment_page.count()

user_id    6030
page       6030
dtype: int64

In [26]:
df_conformation.head(3)

   user_id                       page
0   123100  payment_confirmation_page
1   704999  payment_confirmation_page
2   407188  payment_confirmation_page

In [27]:
df_conformation.count()

user_id    452
page       452
dtype: int64

#### Joining dataframes and renaming columns

In [34]:
df_home.set_index('user_id', inplace = True);

In [35]:
df_search.set_index('user_id', inplace = True);

In [36]:
df_total = df_home.join(df_search, on = 'user_id', how='left', lsuffix='_left', rsuffix='_right')

In [37]:
df_total.tail(3)

         page_left page_right
user_id
167290   home_page        NaN
437765   home_page        NaN
337840   home_page        NaN

In [39]:
df_total.rename({'page_left':'home_page', 'page_right': 'search_page'}, axis=1, inplace = True)

In [41]:
df_total.tail(5)

         home_page  search_page
user_id
456851   home_page          NaN
128619   home_page  search_page
167290   home_page          NaN
437765   home_page          NaN
337840   home_page          NaN

In [45]:
df_payment_page.set_index('user_id', inplace=True);

In [51]:
df_total = df_total.join(df_payment_page, on = 'user_id', how='left', lsuffix='_left', rsuffix='_right');

In [54]:
df_total.rename({'page':'payment_page'}, axis = 1, inplace = True)

In [58]:
df_total.tail(10)

         home_page  search_page  payment_page
user_id
845758   home_page  search_page           NaN
272782   home_page  search_page  payment_page
815516   home_page  search_page           NaN
582615   home_page          NaN           NaN
166121   home_page  search_page           NaN
456851   home_page          NaN           NaN
128619   home_page  search_page           NaN
167290   home_page          NaN           NaN
437765   home_page          NaN           NaN
337840   home_page          NaN           NaN

In [59]:
df_conformation.set_index('user_id', inplace=True);

In [60]:
df_total = df_total.join(df_conformation, on = 'user_id', how='left', lsuffix='_left', rsuffix='_right');

In [61]:
df_total.rename({'page':'conformation'}, axis = 1, inplace = True)

In [64]:
df_total.info

<bound method DataFrame.info of          home_page  search_page  payment_page conformation
user_id
313593   home_page          NaN           NaN          NaN
468315   home_page          NaN           NaN          NaN
264005   home_page          NaN           NaN          NaN
290784   home_page          NaN           NaN          NaN
639104   home_page  search_page           NaN          NaN
262889   home_page          NaN           NaN          NaN
708793   home_page          NaN           NaN          NaN
943143   home_page  search_page           NaN          NaN
417894   home_page          NaN           NaN          NaN
729374   home_page  search_page           NaN          NaN
188061   home_page          NaN           NaN          NaN
899940   home_page          NaN           NaN          NaN
351103   home_page          NaN           NaN          NaN
361882   home_page          NaN           NaN          NaN
899516   home_page          NaN           NaN          NaN
99215    home_page  search_page           NaN          NaN
594691   home_page  search_page           NaN          NaN
432943   home_page  search_page           NaN          NaN
364893   home_page          NaN           NaN          NaN
654707   home_page          NaN           NaN          NaN
272192   home_page  search_page           NaN          NaN
396024   home_page          NaN           NaN          NaN
369723   home_page  search_page           NaN          NaN
438763   home_page          NaN           NaN          NaN
223223   home_page  search_page  payment_page          NaN
140078   home_page          NaN           NaN          NaN
96742    home_page  search_page           NaN          NaN
74432    home_page          NaN           NaN          NaN
819741   home_page          NaN           NaN          NaN
664153   home_page  search_page           NaN          NaN
...            ...          ...           ...          ...
316590   home_page  search_page  payment_page          NaN
605332   home_page          NaN           NaN          NaN
787726   home_page          NaN           NaN          NaN
154945   home_page          NaN           NaN          NaN
442757   home_page          NaN           NaN          NaN
24523    home_page          NaN           NaN          NaN
93920    home_page  search_page           NaN          NaN
778498   home_page          NaN           NaN          NaN
990390   home_page          NaN           NaN          NaN
577786   home_page          NaN           NaN          NaN
336714   home_page  search_page           NaN          NaN
869523   home_page          NaN           NaN          NaN
952004   home_page  search_page           NaN          NaN
907572   home_page  search_page           NaN          NaN
527712   home_page          NaN           NaN          NaN
88921    home_page  search_page           NaN          NaN
836673   home_page  search_page  payment_page          NaN
898306   home_page  search_page           NaN          NaN
529322   home_page          NaN           NaN          NaN
608818   home_page  search_page  payment_page          NaN
845758   home_page  search_page           NaN          NaN
272782   home_page  search_page  payment_page          NaN
815516   home_page  search_page           NaN          NaN
582615   home_page          NaN           NaN          NaN
166121   home_page  search_page           NaN          NaN
456851   home_page          NaN           NaN          NaN
128619   home_page  search_page           NaN          NaN
167290   home_page          NaN           NaN          NaN
437765   home_page          NaN           NaN          NaN
337840   home_page          NaN           NaN          NaN

[90400 rows x 4 columns]>